package com.example.Lab_2

import android.os.Parcelable
import kotlinx.parcelize.Parcelize

@Parcelize
data class Cat(
    val Name: String,
    val Day: Int,
    val Poroda: String,
    val Opus: String,
    val ResId: Int,

    ) : Parcelable

fun createGames(): List<Cat> {
    return listOf(
        Cat(
            "Мурка",
            7,
            "Абісинська кішка",
            "Порода кішок, що має особливе забарвлення (зональне), схоже на забарвлення зайців або кроликів. На тілі немає ніякого малюнка. Таке забарвлення забезпечується тим, що кожен волосок має смуги, які чергуються (тікінг) — світлі (жовті або охристі) і темні (чорні або коричневі). Відбувається це тому, що при розвитку волосся в ньому впереміш відкладається то темний, то світлий пігмент. У зайців або кроликів на волоску є тільки одне темне кільце, тоді як в абісинських кішок два або три (подвійний або потрійний тікінги). Таке забарвлення також називають агуті.",
            R.drawable.img1,

            ),

        Cat(
            "Барсік",
            13,
            "Бірманська кішка",
            "Походження породи пов'язують із храмами й монастирями Бірми, де, як припускають, служителі утримували кішок і вважали їх священними. Можливо, вони були виведені шляхом схрещування сіамських із двоколірними довгошерстими.",
            R.drawable.img3,

            ),

        Cat(
            "Пушок",
            2,
            "Британська короткошерста кішка",
            "Британська короткошерста є однією з найдавніших порід, хоча племінні книги, куди заносяться найкращі плідники, ведуться всього близько 100 років. Офіційно визнана більшістю фелінологічних організацій у 1984 році. Зараз поширена в усьому світі й користується великою популярністю.",
            R.drawable.img2,

            )





    )
    

}